# IsWorksetVisible Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsWorksetVisible Method
View Class See Also
---
Indicates whether the workset is visible in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsWorksetVisible(
	WorksetId worksetId
)
```

Visual Basic
---
```text
Public Function IsWorksetVisible ( _
	worksetId As WorksetId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
```

# ### Parameters
worksetId
    Type: Autodesk.Revit.DB..::..WorksetId Id of the workset.
# ### Return Value
Whether the workset is visible.
# Remarks
It will take into account whether the workset is opened or closed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | There is no workset with this Id in the document associated with this view. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace